Revit 2027 API
BuiltInFailures.RoomFailures.RoomsOverlapInHeight Property
 [Room] volumes overlap. Adjust the Upper Limit and Limit Offset properties of the [rooms].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomsOverlapInHeight { get; }
Public Shared ReadOnly Property RoomsOverlapInHeight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomsOverlapInHeight {
	FailureDefinitionId^ get ();
}
static member RoomsOverlapInHeight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace